# Підготовка бази даних

обовьязково встановлюємо ці бібліотеки для коректної роботи магічних методів jupyter notebook, або встановюємо всі необхідні залежності через requirements.txt

In [1]:
# !pip install psycopg2-binary
# !pip install ipython-sql

створюємо volumes для збереження даних поза контейнером та сам контейнер

In [2]:
!docker volume create pgdata

pgdata

In [3]:
!docker run -d -e POSTGRES_USER=leshafamilenko -e POSTGRES_PASSWORD=gugaga98 -e POSTGRES_DB=my_data -p 5432:5432 -v pgdata:/var/lib/postgresql/data postgres

Unable to find image 'postgres:latest' locally
latest: Pulling from library/postgres

a096dd42: Pulling fs layer
791cead4: Pulling fs layer
9d4caf63: Pulling fs layer
5cc18d98: Pulling fs layer
4434669b: Pulling fs layer
3e99974b: Pulling fs layer
5d80af0f: Pulling fs layer
361e1963: Pulling fs layer
63053d93: Pulling fs layer
cb9fc671: Pulling fs layer
0eae30b3: Pulling fs layer
9082d41c: Pulling fs layer
48e79784: Pulling fs layer
Digest: sha256:994cc3113ce004ae73df11f0dbc5088cbe6bb0da1691dd7e6f55474202a4f211Downloading  5.409MB/8.066MB
Status: Downloaded newer image for postgres:latest
9f4bb3696b16d7ac5eff705079cdb6412461918cf62dd52c9a0292bd021f611c

In [4]:
# !docker stop 2d1b0c3a878f0cedb820a9caa4818753d97b6f4f515c88596ff1ddf983d08fdc

даємо базі даних час на створення та зьєднання

In [5]:
import time

time.sleep(3)

підʼєднємось до бази

In [6]:
%load_ext sql
%sql postgresql://leshafamilenko:gugaga98@localhost:5432/my_data

створюємо необхідні таблиці

In [7]:
%%sql
CREATE TABLE users (
    id SERIAL PRIMARY KEY,
    fullname VARCHAR(100),
    email VARCHAR(100) UNIQUE
);

 * postgresql://leshafamilenko:***@localhost:5432/my_data
Done.

[]

In [8]:
%%sql
CREATE TABLE status (
    id SERIAL PRIMARY KEY,
    name VARCHAR(50) UNIQUE
);

 * postgresql://leshafamilenko:***@localhost:5432/my_data
Done.

[]

In [9]:
%%sql
INSERT INTO status (name) VALUES ('new'), ('in progress'), ('completed');

 * postgresql://leshafamilenko:***@localhost:5432/my_data
3 rows affected.

[]

In [10]:
%%sql
CREATE TABLE tasks (
    id SERIAL PRIMARY KEY,
    title VARCHAR(100),
    description TEXT,
    status_id INTEGER REFERENCES status(id),
    user_id INTEGER REFERENCES users(id) ON DELETE CASCADE
);

 * postgresql://leshafamilenko:***@localhost:5432/my_data
Done.

[]

заповнюємо базу фейковими даними

In [11]:
import psycopg2
import pandas as pd
from sqlalchemy import create_engine

from seed import seed_users, seed_tasks

In [12]:
db_params = {
    'dbname': 'my_data',
    'user': 'leshafamilenko',
    'password': 'gugaga98',
    'host': 'localhost',
    'port': '5432'
}

conn = psycopg2.connect(**db_params)
cur = conn.cursor()

seed_users(10, cur)
seed_tasks(10, cur)

conn.commit()
cur.close()
conn.close()

прописуємо для зручності функцію для селект запитів через пандас

In [13]:
engine = create_engine(f"postgresql://{db_params['user']}:{db_params['password']}@{db_params['host']}:{db_params['port']}/{db_params['dbname']}")

def make_select(query):
    result = pd.read_sql_query(query, engine)
    return result

In [14]:
# def make_select(query):
#     conn = psycopg2.connect(**db_params)
#     result = pd.read_sql_query(query, conn)
#     conn.close()
#     return result

перевіряємо дані

In [15]:
make_select("SELECT * FROM tasks LIMIT 5;")

,id,title,description,status_id,user_id
0,1,Ahead new however partner.,Onto rock field. Tough to tonight month bed ne...,2,3
1,2,The west task still ten be.,Join ground dinner mouth team quickly. Wish ea...,3,8
2,3,Key more western stage democratic thought trade.,White paper baby hour successful direction cul...,3,7
3,4,Direction get college nothing.,Usually reveal morning teacher site wait press...,3,7
4,5,Decade prepare senior bring six coach eye fill.,Avoid owner spend produce our. Who health exec...,3,8

In [16]:
make_select("SELECT * FROM users LIMIT 5;")

   id                fullname                        email
0   1          Philip Sanchez  christiansheila@example.net
1   2            James Bryant         xjackson@example.net
2   3  Christopher Willis PhD  douglassullivan@example.net
3   4           Mercedes Rose           alloyd@example.org
4   5          Leonard Madden        valerie71@example.net

In [17]:
make_select("SELECT * FROM status LIMIT 5;")

   id         name
0   1          new
1   2  in progress
2   3    completed

# Запити для виконання:

### Отримати всі завдання певного користувача. Використайте SELECT для отримання завдань конкретного користувача за його user_id.

In [19]:
make_select("SELECT * FROM tasks WHERE user_id = 1;")

,id,title,description,status_id,user_id
0,8,Consumer bed national decision a.,Either common red few. Possible east commercia...,2,1

### Вибрати завдання за певним статусом. Використайте підзапит для вибору завдань з конкретним статусом, наприклад, 'new'.

In [20]:
make_select("SELECT * FROM tasks WHERE status_id in (SELECT id FROM status WHERE name = 'new');")

,id,title,description,status_id,user_id
0,7,Customer final now Congress.,Compare up red debate over base. Subject conta...,1,2
1,9,Quickly mind moment attorney less.,Task professional far store. Season maintain p...,1,10
2,10,Such senior garden discussion agree.,General describe sing sort use. Water ready ag...,1,4

### Оновити статус конкретного завдання. Змініть статус конкретного завдання на 'in progress' або інший статус.

In [21]:
%%sql
UPDATE tasks SET status_id = 3 WHERE id = 7;

 * postgresql://leshafamilenko:***@localhost:5432/my_data
1 rows affected.

[]

In [22]:
make_select("SELECT * FROM tasks WHERE id = 7;")

,id,title,description,status_id,user_id
0,7,Customer final now Congress.,Compare up red debate over base. Subject conta...,3,2

### Отримати список користувачів, які не мають жодного завдання. Використайте комбінацію SELECT, WHERE NOT IN і підзапит.

In [23]:
make_select("SELECT * FROM users WHERE id NOT IN (SELECT user_id FROM tasks);")

   id             fullname                   email
0   5       Leonard Madden   valerie71@example.net
1   6  Michelle Washington  cheyenne68@example.org
2   9        Deborah Villa   avilachad@example.com

### Додати нове завдання для конкретного користувача. Використайте INSERT для додавання нового завдання.

In [24]:
%%sql
INSERT INTO tasks (title, description, status_id, user_id)
VALUES ('New task', 'New task description', 1, (SELECT id FROM users WHERE fullname = 'Deborah Villa'));

 * postgresql://leshafamilenko:***@localhost:5432/my_data
1 rows affected.

[]

In [25]:
make_select("SELECT * FROM tasks JOIN users ON tasks.user_id = users.id WHERE users.fullname = 'Deborah Villa';")

,id,title,description,status_id,user_id,id,fullname,email
0,11,New task,New task description,1,9,9,Deborah Villa,avilachad@example.com

### Отримати всі завдання, які ще не завершено. Виберіть завдання, чий статус не є 'завершено'.

In [26]:
make_select("SELECT * FROM tasks WHERE status_id IN (SELECT id FROM status WHERE name != 'completed');")

,id,title,description,status_id,user_id
0,1,Ahead new however partner.,Onto rock field. Tough to tonight month bed ne...,2,3
1,8,Consumer bed national decision a.,Either common red few. Possible east commercia...,2,1
2,9,Quickly mind moment attorney less.,Task professional far store. Season maintain p...,1,10
3,10,Such senior garden discussion agree.,General describe sing sort use. Water ready ag...,1,4
4,11,New task,New task description,1,9

### Видалити конкретне завдання. Використайте DELETE для видалення завдання за його id.

In [27]:
%%sql
DELETE FROM tasks WHERE id = 1;

 * postgresql://leshafamilenko:***@localhost:5432/my_data
1 rows affected.

[]

In [28]:
make_select("SELECT * FROM tasks;").sort_values('id').head(5)

,id,title,description,status_id,user_id
0,2,The west task still ten be.,Join ground dinner mouth team quickly. Wish ea...,3,8
1,3,Key more western stage democratic thought trade.,White paper baby hour successful direction cul...,3,7
2,4,Direction get college nothing.,Usually reveal morning teacher site wait press...,3,7
3,5,Decade prepare senior bring six coach eye fill.,Avoid owner spend produce our. Who health exec...,3,8
4,6,Way professor beyond remember draw.,Technology fast my physical program.\nBe examp...,3,2